<template>
  <div class="clause-box">
    <el-dialog title="温馨提示" :visible.sync="dialogFormVisible" top="10vh">
      <el-dialog
        width="290px"
        title="扫码支付"
        :visible.sync="innerVisible"
        append-to-body>
        <vue-qr :logoSrc="imageUrl" :logoScale="0.3" :text="codeUrl" :size="250" :dotScale="dotScale"></vue-qr>
      </el-dialog>
      <div class="clause">
        <h1>前言</h1>
        <h2>INU 重大疾病互助保障计划条款</h2>
        <p>INU 生命互助相互保障社区是由 InUnion Chain LTD.发起，利用区块链技术与通证理
          念，由社区会员自我管理的全球性的互助保障社区。社区不以盈利为目的，秉承会员互助共
          济、风险共担的理念。InUnion Chain LTD 发行的 INU 通证最初是提供给本社区建设的捐助
          者、建设者和倡导者，本社区中会员可以使用 INU 享受本社区提供的互助保障服务。</p>
        <p>为简化词义表达，贴近读者的用语习惯，定义如下词语解释，词语如有雷同以本文释
          义为准：</p>
        <p> “投保”：是指签署互助保障计划协议，参与到本互助保障计划的行为。</p>
        <p> “投保人”：是指签署本协议，按照协议负有支付本计划互助费的义务的人。在本协议中以“您”
          代称。</p>
        <p> “被互助保障人”、“被保障人”、“互助金申请人”：是指人身受本协议的互助保障，享有互助金
          请求权的人，本协议的被保障人就是投保人。</p>
        <p> “受益人” : 是指由投保人或被保障人指定的，享有保障金请求权的人。除另有约定外，受益
          人为被保障人本人。</p>
        <p> 您在确认加入本计划前请仔细阅读本条款，在您确认参与后即默认您已充分理解本条款的全
          部内容，并同意认真遵守本条款的权利义务。社区为投保的 INU 会员提供互助保障计划电
          子单据。</p>
        <h4>关于协议</h4>
        <p>1.1 互助保障计划协议的构成 协议由互助保障计划条款及所附条款、投保文件，以及合
          法有效的声明、健康告知书等经您与社区共同认可的有关的其他文件。</p>
        <p> 1.2 年龄范围 本协议接受投保时被互助保障人的年龄为 0 周岁（出生满 30 天）至 60
          周岁（含 60 周岁）。</p>
        <p> 1.3 协议成立与生效 您提出互助保障申请并支付社区服务费，经审核通过后本协议成立，
          审核不通过已支付的服务费全额退还。除另有约定外，自本协议成立的次日零时起本协议生
          效，投保人在本互助保障计划中的权利和义务全面生效，且投保人授权社区代为其履行对参
          与本计划的其他会员的互助行为，即由社区对其他被保障人提供互助保障服务。</p>
        <p>1.4 互助保障期间 本协议互助保障期间为一年，自本协议生效之日零时起至本协议约定终
          止日二十四时止。</p>
        <h4>互助保障责任</h4>
        <h4> 2.1 互助保障责任</h4>
        <p>在本协议有效期间内，社区的互助保障责任：</p>
        <p> 一、若被互助保障人于本协议生效起 180 日内（含第 180 日）因意外伤害以外的原因初次
          患本协议所列的重大疾病，社区将无息返还您所交的服务费，本协议终止。</p>
        <p> 二、若被互助保障人因意外伤害，或于本协议生效之日起 180 日后因意外伤害以外的原因
          初次患本协议所列的重大疾病，社区按本协议载明的互助金额给付重大疾病互助金，本协议
          终止。</p>
        <h4> 2.2 责任免除</h4>
        <p> 一、因下列情形之一导致被互助保障人患重大疾病的，社区不承担给付互助金的责任</p>
        <p>（一）INU 会员对被互助保障人的故意杀害、故意伤害；</p>
        <p>（二）被互助保障人故意犯罪或抗拒依法采取的刑事强制措施；</p>
        <p>（三）被互助保障人殴斗、故意自伤；</p>
        <p>（四）被互助保障人主动吸食或注射毒品；</p>
        <p>（五）被互助保障人酒后驾驶、无合法有效驾驶证驾驶，或驾驶无有效行驶证的机动车；</p>
        <p>（六）战争、军事冲突、暴乱、恐怖活动或武装叛乱（以上行为以政府宣告或 认定为准）；</p>
        <p>（七）任何生物、化学、原子能武器，原子能或核能装置所造成的爆炸、灼伤、污染或辐射；</p>
        <p>（八）遗传性疾病、先天性畸形、变形或染色体异常。</p>
        <p> 二、发生上述第（一）种情形导致被互助保障人患重大疾病的，本协议终止。社区向其他权
          利人退还本协议服务费，其他权利人按照被互助保障人、 被互助保障人第一顺序法定继承
          人，第二顺序法定继承人的顺序确定。</p>
        <p> 三、发生上述其他情形导致被互助保障人患重大疾病的，本协议终止，社区向您退还本协议
          服务费。</p>
        <h4> 2.3 互助金额</h4>
        <p>本协议的互助金额由您在投保时与社区约定，并在互助保障单据上载明。
          互助金的申请</p>
        <h4> 3.1 申请互助人</h4>
        <p> 除另有约定外，重大疾病互助金的申请互助人为被互助保障人本人。</p>
        <h4> 3.2 互助保障事故通知</h4>
        <p> 您、被互助保障人或申请互助人应于知道互助保障事故发生之日起 10 日内通知社区。若故
          意或者因重大过失未及时通知，致使互助保障事故的性质、原因、损失程度等难以确定的，
          社区对无法确定的部分，不承担给付互助金的责任，但社区通过其他途径已经及时知道或应
          当及时知道互助保障事故发生或虽未及时通知但不影响社区确定互助保障事故的性质、原
          因、损失程度的除外。</p>
        <h4> 3.3 互助金申请</h4>
        <p>在申请互助金时，请按照下列方式办理：</p>
        <p>由申请互助人或被互助保障人的继承人作为申请人填写互助金给付申请书，并向社区提供下
          列资料：</p>
        <p>(一) 申请人的有效身份证件；</p>
        <p> (二) 医疗监管行政部门认定的医疗机构出具的可证明被互助保障人患重大疾病的诊断证明
          和诊断所患重大疾病必需的检查报告；</p>
        <p> (三) 所能提供的与确认互助保障事故的性质、原因、伤害程度等有关的其他资料。</p>
        <p> (四) 互助金作为被互助保障人遗产时，申请人还须提供可证明合法继承权的相关权利文件。</p>
        <h4> 3.4 互助金给付</h4>
        <p>一、 社区在收到互助金给付申请书及本协议约定的资料后，将在 3 日内作出核定；情形复
          杂的，在 30 日内作出核定。对属于互助保障责任的，社区在与申请互助人达成给付互助金
          的协议后 1 日内，履行给付互助金义务。</p>
        <p> 二、 社区未及时履行前款规定义务的，除支付互助金外，应当赔偿申请互助人因此受到的
          损失。</p>
        <p> 三、 对不属于互助保障责任的，社区自作出核定之日起 3 日内向申请互助人发出拒绝给付
          互助金通知书并说明理由。</p>
        <p>四、 如果申请互助人向社区提起虚假的互助保障金申请，社区有权追回已支付的相应互助
          保障金，并对其他虚假理赔的申请且尚未支付的款项拒绝支付，解除本协议，在社区公示欺
          骗行为，并取消申请互助人会员资格。</p>
        <h4> 3.5 钱包地址等变更</h4>
        <p> 您的钱包地址变更时，请及时以双方认可的其他形式通知社区，审核后通知本人。</p>
        <h4> 3.6 诉讼时效</h4>
        <p> 申请人向社区请求给付互助金的诉讼时效期间为 2 年，自其知道或应当知道互助保障事 故
          发生之日起计算。</p>
        <h4>协议解除</h4>
        <h4> 4.1 您解除协议的手续及风险</h4>
        <p>您解除协议的手续及风险 如您申请解除本协议，请填写解除协议申请书并向社区提供下列
          资料：</p>
        <p> 1. 互助计划；</p>
        <p> 2. 您的有效身份证件。 </p>
        <p>自社区收到解除协议申请书时起，本协议终止。</p>
        <p> 社区自收到解除协议申请书之日起 30 日内向您退还本协议的未满期净服务费。如果被
          互助保障人已经发生互助保障事故或社区已经支付互助保障赔款，社区将不退回未满期净服
          务费。您申请解除协议会遭受一定损失。</p>
        <h4> 4.2 如实告知</h4>
        <p>一、社区就您和被互助保障人的有关情况提出询问的，您应当如实告知。</p>
        <p>二、若您故意或因重大过失未履行前款规定的如实告知义务，足以影响社区决定是否同意承
          保或提高服务费率的，社区有权解除本协议。</p>
        <p>三、若您故意不履行如实告知义务，对于本协议解除前发生的互助保障事故，社区不承担给
          付互助金的责任，并不退还服务费。</p>
        <p> 四、若您因重大过失未履行如实告知义务，对互助保障事故的发生有严重影响的，对于本协
          议解除前发生的互助保障事故，社区不承担给付互助金的责任。</p>
        <h4> 协议终止</h4>
        <h4>5.1 协议效力终止</h4>
        <p> 当发生下列情形之一时，本协议效力终止：</p>
        <p>(一) 本协议期满日零时；</p>
        <p>(二) 您申请解除本协议；</p>
        <p>(三) 因本协议其他条款所列情况而效力终止。</p>
        <h4>5.2 未还款项</h4>
        <p> 社区在给付各项互助金或者返还服务费时，如果您有欠交其他各项欠款，社区按照您和其他
          权利人与社区的约定，在扣除上述各项欠款后给付。</p>
        <h4> 5.3 争议处理</h4>
        <p> 本协议适用英属维京群岛法律，因本条款引起的或与本条款有关的任何争议，由当事人协商
          解决。协商不成的，可提请所在国家或地区高级仲裁委员会按照其仲裁规则进行仲裁。仲裁
          裁决是终局的，对双方均有约束力。</p>
        <h1>附件一</h1>
        <h2>会员和社区的权利义务</h2>
        <h4>会员的权利义务</h4>
        <p>一、您有权查阅本计划公布的互助事件及活动信息。</p>
        <p>二、您应确保您在参与本计划时留下的信息是真实准确的，否则您将无法获得帮助。</p>
        <p>三、您有义务保证不在计划运行过程中发布包含诈骗、非法、色情、淫秽、暴力等违反法律
          法规、政策的内容，不发表含有攻击性、侮辱性的言论。</p>
        <p>四、您应妥善保管在 INU 生命互助保障社区上注册的信息，凡使用您的信息登陆 INU 社区
          进行的一切操作，均视为您本人的行为，一切责任由您本人承担。</p>
        <p>五、互助保障计划会员有权在需要时获得其他互助保障计划会员的互助，也有义务根据互助
          事件向其他互助保障计划会员提供互助。</p>
        <p>六、您可获得本计划提供的信息、资料、咨询和服务，查看社区参与互助事件的记录，并对
          该互助事件提出质疑。</p>
        <p> 七、一旦出现互助申请人通过提供虚假资料和信息而获得互助的情形，您有权委托 INU 生
          命互助保障社区向互助申请人进行追偿。</p>
        <p>八、您对本计划有批评权、建议权和监督权。</p>
        <p>九、申请互助金的会员如果提供虚假资料，INU 社区将被取消获得互助的资格和社区会员资
          格，并追讨其不当得利，情况严重时或对其提起诉讼。</p>
        <p> 十、您同意 INU 社区可单方面判断并决定，如果您违反本条款或 INU 社区的规则，出现损
          害本计划和其他会员的行为，INU 社区可随时终止您某些服务的使用，并可将您在 INU 社区
          中留存的任何内容加以移除或删除，同时对您终止部分或全部服务。</p>
        <h4> INU 生命互助保障社区权利义务</h4>
        <p>一、INU 生命互助保障社区有权发起各项互助并协助会员互助。</p>
        <p>二、INU 生命互助保障社区或其指定第三方有权对互助保障计划会员的互助申请进行审核，
          并最终决定申请会员是否可以获得互助。</p>
        <p>三、如出现互助申请人通过提供虚假资料和信息而获得互助的情形，INU 生命互助保障社区
          有义务代全体互助保障计划会员向互助申请人追偿。</p>
        <p>四、INU 生命互助保障社区为本计划提供技术服务，该服务可能会受到各个环节不稳定因素
          的影响。因此服务存在不可抗力、计算机病毒或黑客攻击、互联网络、通信线路原因等造成
          的服务中断或不能满足互助保障计划会员要求的风险，INU 生命互助保障社区会在第一时间
          进行修复处理，但会员因此而产生的任何损失，INU 生命互助保障社区不承担责任。</p>
        <p>五、INU 生命互助保障社区属于创新型项目，可能会受到所在国家法律法规及政策的影响，
          导致本计划不能继续提供相应的服务，您成为相互保障计划会员时即表明您已充分了解本计
          划存在的风险，如因此使您遭受损失，您同意自行承担，INU 生命互助保障社区不承担任何
          责任</p>
        <p> 六、INU 生命互助保障社区有权制定不同方案，激励会员通过完成邀请或其它任务社区会
          员的福祉，以及增进互助保障计划投保人、服务人员的权利。</p>
        <h1>附件二</h1>
        <h2>重大疾病种类</h2>
        <p>初次患本协议所列的重大疾病指被互助保障人患同时符合以下条件的重大疾病：</p>
        <p>(一)被互助保障人自出生后首次出现该重大疾病之症状体征；</p>
        <p> (二)被互助保障人在本协议有效期间内首次出现该重大疾病之症状体征并被确诊患该 重大
          疾病；</p>
        <p> (三)该重大疾病之症状体征符合本协议的定义；</p>
        <p> (四)该重大疾病已在本协议中列明。 对于被互助保障人在本协议生效日前出现的本协议所
          列的重大疾病，本社区不承担给 付互助金责任。</p>
        <p>重大疾病指被本保障计划会员发生符合以下疾病定义所述条件的疾病（共 50 种），应当由
          专科医生明确诊断。</p>
        <h4>1、恶性肿瘤</h4>
        <p>指恶性细胞不受控制的进行性增长和扩散，浸润和破坏周围正常组织，可以经血管、淋巴管
          和体腔扩散转移到身体其它部位的疾病。经病理学检查结果明确诊断，临床诊断属于世界卫
          生组织《疾病和有关健康问题的国际统计分类》（ICD-10）的恶性肿瘤范畴。下列疾病不在
          保障范围内：</p>
        <p>（1）原位癌；</p>
        <p>（2）相当于 Binet 分期方案 A 期程度的慢性淋巴细胞白血病；</p>
        <p>（3）相当于 Ann Arbor 分期方案 I 期程度的何杰金氏病；</p>
        <p>（4）皮肤癌（不包括恶性黑色素瘤及已发生转移的皮肤癌）；</p>
        <p>（5）TNM 分期为 T1N0M0 期或更轻分期的前列腺癌；</p>
        <p>（6）感染艾滋病病毒或患艾滋病期间所患恶性肿瘤。</p>
        <h4>2、急性心肌梗塞</h4>
        <p>指因冠状动脉阻塞导致的相应区域供血不足造成部分心肌坏死。须满足下列至少三 项条
          件：</p>
        <p>（1）典型临床表现，例如急性胸痛等；</p>
        <p>（2）新近的心电图改变提示急性心肌梗塞；</p>
        <p>（3）心肌酶或肌钙蛋白有诊断意义的升高，或呈符合急性心肌梗塞的动态性变化；</p>
        <p>（4）发病 90 天后，经检查证实左心室功能降低的，如左心室射血分数低于 50%。</p>
        <h4>3、脑中风后遗症</h4>
        <p> 指因脑血管的突发病变引起脑血管出血、栓塞或梗塞，并导致神经系统永久性功能 障碍。
          神经系统永久性的功能障碍，指疾病确诊 180 天后，仍遗留下列一种或一种 以上障碍：</p>
        <p>（1）一肢或一肢以上肢体机能完全丧失；</p>
        <p>（2）语言能力或咀嚼吞咽能力完全丧失；</p>
        <p>（3）自主生活能力完全丧失，无法独立完成六项基本日常生活活动中的三项或三项以上。</p>
        <h4>4、重大器官移植术或造血干细胞移植术重大器官移植术，指因相应器官功能衰竭，已经实
          施了肾脏、肝脏、心脏或肺脏的 异体移植手术。造血干细胞移植术，指因造血功能损害或
          造血系统恶性肿瘤，已经实施了造血干细胞（包括骨髓造血干细胞、外周血造血干细胞和脐
          血造血干细胞）的异体移植手术。</h4>
        <h4> 5、冠状动脉搭桥术</h4>
        <p>指为治疗严重的冠心病，实际实施了开胸进行的冠状动脉血管旁路移植的手术。冠状动脉
          支架植入手术、心导管球囊扩张术、激光射频技术及其他非开胸的介入手术、腔镜手术不在
          保障范围内。</p>
        <h4> 6、终末期肾病</h4>
        <p>指双肾功能慢性不可逆性衰竭，达到尿毒症期，经诊断后已经进行了至少 90 天的规律性
          透析治疗或实施了肾脏移植手术。</p>
        <h4>7、多个肢体缺失</h4>
        <p>指因疾病或意外伤害导致两个或两个以上肢体自腕关节或踝关节近端（靠近躯干 端）以上
          完全性断离。</p>
        <h4> 8、急性或亚急性重症肝炎指因肝炎病毒感染引起肝脏组织弥漫性坏死，导致急性肝功能衰
          竭，且经血清学或病毒学检查证实，并须满足下列全部条件：</h4>
        <p>（1）重度黄疸或黄疸迅速加重；</p>
        <p>（2）肝性脑病；</p>
        <p>（3）B 超或其他影像学检查显示肝脏体积急速萎缩；</p>
        <p>（4）肝功能指标进行性恶化。</p>
        <h4> 9、良性脑肿瘤</h4>
        <p>指脑的良性肿瘤，已经引起颅内压增高，临床表现为视神经乳头水肿、精神症状、癫痫及
          运动感觉障碍等，并危及生命。须由头颅断层扫描（CT）、核磁共振检查（MRI）或正电子发
          射断层扫描（PET）等影像学检查证实，并须满足下列至少一项条件：</p>
        <p>（1）实际实施了开颅进行的脑肿瘤完全切除或部分切除的手术；</p>
        <p>（2）实际实施了对脑肿瘤进行的放射治疗。脑垂体瘤、脑囊肿、脑血管性疾病不在保障范
          围内。</p>
        <h4> 10、慢性肝功能衰竭失代偿期</h4>
        <p> 指因慢性肝脏疾病导致肝功能衰竭，须满足下列全部条件：</p>
        <p>（1）持续性黄疸；</p>
        <p>（2）腹水；</p>
        <p>（3）肝性脑病；</p>
        <p>（4）充血性脾肿大伴脾功能亢进或食管胃底静脉曲张。因酗酒或药物滥用导致的肝功能衰
          竭不在保障范围内。</p>
        <h4>11、脑炎后遗症或 脑膜炎后遗症 指因患脑炎或脑膜炎导致的神经系统永久性的功能障碍。
          神经系统永久性的功能障碍，指疾病确诊 180 天后，仍残留下列一种或一种以上障碍：</h4>
        <p>（1）一肢或一肢以上肢体机能完全丧失；</p>
        <p>（2）语言能力或咀嚼吞咽能力完全丧失；</p>
        <p>（3）自主生活能力完全丧失，无法独立完成六项基本日常生活活动中的三项或三项以上。</p>
        <h4>12、深度昏迷</h4>
        <p>指因疾病或意外伤害导致意识丧失,对外界刺激和体内需求均无反应，昏迷程度按 照格拉
          斯哥昏迷分级（Glasgow coma scale）结果为 5 分或 5 分以下，且已经持续使用呼吸机及其
          它生命维持系统 96 小时以上。由于酗酒或药物滥用导致的深度昏迷不在保障范围内。</p>
        <h4> 13、双耳失聪—— 三岁始理赔 指因疾病或意外伤害导致双耳听力永久不可逆性丧失，在
          500 赫兹、1000 赫兹和 2000 赫兹语音频率下，平均听阈大于 90 分贝，且经纯音听力测试、
          声导抗检 测或听觉诱发电位检测等证实。被互助保障人申请理赔时年龄必须在三周岁以上，
          并且提供理赔当时的听力丧失诊断 及检查证据。</h4>
        <h4> 14、双目失明—— 三岁始理赔</h4>
        <p>指因疾病或意外伤害导致双眼视力永久不可逆性丧失，双眼中较好眼须满足下列至少一项
          条件：</p>
        <p>（1）眼球缺失或摘除；</p>
        <p> （2）矫正视力低于 0.02（采用国际标准视力表，如果使用其他视力表应进行换算）；</p>
        <p>（3）视野半径小于 5 度。被互助保障人申请理赔时年龄必须在三周岁以上，并且提供理赔</p>
        <p> 当时的视力丧失诊断及检查证据。</p>
        <h4>15、瘫痪</h4>
        <p> 指因疾病或意外伤害导致两肢或两肢以上肢体机能永久完全丧失。肢体机能永久完 全丧
          失，指疾病确诊 180 天后或意外伤害发生 180 天后，每肢三大关节中的两大关 节仍然完
          全僵硬，或不能随意识活动。</p>
        <p>16、心脏瓣膜手术指为治疗心脏瓣膜疾病，实际实施了开胸进行的心脏瓣膜置换或修复的
          手术。</p>
        <h4> 17、严重阿尔茨海默病</h4>
        <p> 指因大脑进行性、不可逆性改变导致智能严重衰退或丧失，临床表现为明显的认知 能力障
          碍、行为异常和社交能力减退，其日常生活必须持续受到他人监护。须由头 颅断层扫描（CT）、
          核磁共振检查（MRI）或正电子发射断层扫描（PET）等影像学 检查证实，自主生活能力完
          全丧失，无法独立完成六项基本日常生活活动中的三项 或三项以上。神经官能症和精神疾
          病不在保障范围内。</p>
        <h4> 18、严重脑损伤</h4>
        <p>指因头部遭受机械性外力，引起脑重要部位损伤，导致神经系统永久性的功能障碍。须由
          头颅断层扫描（CT）、核磁共振检查（MRI）或正电子发射断层扫描（PET）等影像学检查证
          实。神经系统永久性的功能障碍，指脑损伤 180 天后，仍遗留下列一种或一种以上障碍：</p>
        <p>（1）一肢或一肢以上肢体机能完全丧失；</p>
        <p>（2）语言能力或咀嚼吞咽能力完全丧失；</p>
        <p>（3）自主生活能力完全丧失，无法独立完成六项基本日常生活活动中的三项或三项以上。</p>
        <h4>19、严重帕金森病</h4>
        <p> 指一种中枢神经系统的退行性疾病，临床表现为震颤麻痹、共济失调等。须满足下列全部
          条件：</p>
        <p> （1）药物治疗无法控制病情；</p>
        <p>（2）自主生活能力完全丧失，无法独立完成六项基本日常生活活动中的三项或三项以上。
          继发性帕金森综合征不在保障范围内。</p>
        <h4>20、严重 III 度烧伤指烧伤程度为Ⅲ度，且Ⅲ度烧伤面积达到全身体表面积的 20％或 20％
          以上。体表面积根据《中国新九分法》计算。</h4>
        <h4> 21、严重原发性肺 动脉高压指不明原因的肺动脉压力持续性增高，进行性发展而导致的慢
          性疾病，已经造成永久不可逆性的体力活动能力受限，达到美国纽约心脏病学会心功能状态
          分级 IV 级，静息状态下肺动脉平均压超过 30mmHg。</h4>
        <h4> 22、严重运动神经元病</h4>
        <p>是一组中枢神经系统运动神经元的进行性变性疾病，包括进行性脊肌萎缩症、进行 性延髓
          麻痹症、原发性侧索硬化症、肌萎缩性侧索硬化症。须满足自主生活能力完 全丧失，无法
          独立完成六项基本日常生活活动中的三项或三项以上。
        <h4> 23、语言能力丧失，三岁始可申请互助金</h4>
        <p>指因疾病或意外伤害导致完全丧失语言能力，经过积极治疗至少 12 个月（声带完全 切除
          不受此时间限制），仍无法通过现有医疗手段恢复。精神心理因素所致的语言能力丧失不在
          保障范围内。被互助保障人申请理赔时年龄必须在三周岁以上，并且提供理赔当时的语言能
          力丧失诊断及检查证据。</p>
        <h4> 24、重型再生障碍性贫血</h4>
        <p>指因骨髓造血功能慢性持续性衰竭导致的贫血、中性粒细胞减少及血小板减少，须满足下
          列全部条件：</p>
        <p>（1）骨髓穿刺检查或骨髓活检结果支持诊断；</p>
        <p>（2）外周血象必须具备以下三项条件：</p>
        <p> ①中性粒细胞绝对值≤0.5×109/L；</p>
        <p>②网织红细胞＜1%；</p>
        <p> ③血小板绝对值≤20×109/L。</p>
        <h4>25、主动脉手术</h4>
        <p>指为治疗主动脉疾病，实际实施了开胸或开腹进行的切除、置换、修补病损主动脉血管的
          手术。主动脉指胸主动脉和腹主动脉，不包括胸主动脉和腹主动脉的分支血 管。动脉内血
          管成形术不在保障范围内。</p>
        <h4>26、慢性呼吸功能 衰竭慢性肺部疾病导致永久不可逆性的慢性呼吸功能衰竭。慢性呼吸功
          能衰竭必须明确诊断并满足下列全部条件：</h4>
        <p>（1）休息时出现呼吸困难；</p>
        <p>（2）动脉血氧分压 （PaO2）< 50mmHg；</p>
        <p>（3）动脉血氧饱和度 （SaO2）< 80％；</p>
        <p>（4）因缺氧必须接受持续的输氧治疗。</p>
        <h4>27、严重多发性硬化</h4>
        <p>多发性硬化为中枢神经系统白质多灶性脱髓鞘病变，病变有时累及灰质。多发性硬化必须
          明确诊断，并且已经造成永久不可逆的神经系统功能损害。永久不可逆的神经系统损害指被
          互助保障人持续 180 天无法独立完成下列基本日常生活活动：</p>
        <p>（1）移动：自己从一个房间到另一个房间；或者</p>
        <p>（2）进食：自己从已准备好的碗或碟中取食物放入口中。</p>
        <h4>28、重症肌无力</h4>
        <p>重症肌无力是一种神经肌肉接头传递障碍所致的疾病，表现为局部或全身骨骼肌 （特别是
          眼外肌）极易疲劳。疾病可以累及呼吸肌、上肢或下肢的近端肌群或全身 肌肉，必须满足
          下列全部条件：</p>
        <p>（1）经药物治疗和胸腺切除治疗一年以上仍无法控制病情；</p>
        <p>（2）自主生活能力完全丧失，无法独立完成六项基本日常生活活动中的三项或三 项以上。</p>
        <h4>29、严重心肌病</h4>
        <p>指不明原因引起的一类心肌病变，包括原发性扩张型心肌病、原发性肥厚型心肌病 及原发
          性限制型心肌病三种，本病须经专科医生明确诊断，且病变必须已造成事实 上心室功能障
          碍而出现明显的心功能衰竭（指按照美国纽约心脏协会心功能分类标 准心功能达四级*），
          且有相关住院医疗记录及检查显示四级心功能衰竭状态持续至少 180 天。继发于全身性疾
          病或其它器官系统疾病以及由于酒精和药物滥用造成 的心肌病变不在保障范围内。</p>
        <h4>30、严重类风湿性关节炎</h4>
        <p> 指类风湿性关节炎患者必须符合以下三项标准:</p>
        <p>（1）至少包括下列关节中的三组或以上有广泛受损和畸形改变:手指关节、腕关节、 肘关
          节、膝关节、髋关节、踝关节、脊椎或脚趾关节；</p>
        <p> （2）手和腕的后前位 X 线拍片检查可见类风湿性关节炎的典型变化，包括骨质侵 蚀或钙
          流失，位于受累关节及其邻近部位尤其明显；</p>
        <p>（3）关节的畸形改变至少持续 6 个月。必须经专科医生明确诊断，且首次已接受膝关节或
          髋关节置换手术。</p>
        <h4>31、系统性红斑狼疮 III 型或以上狼疮性肾炎
          狼疮性肾炎是系统性红斑狼疮的一种并发症。系统性红斑狼疮是由多种因素引起，累及多
          系统的自身免疫性疾病，其特点是生成自身抗体对抗多种自身抗原。狼疮性肾炎是指系统性
          红斑狼疮患者并发狼疮性肾炎而影响和损害肾脏功能。世界卫生组织（WHO）狼疮性肾炎
          分型：</h4>
        <p>严重狼疮性肾炎是指经肾脏活检确认的，符合 WHO 诊断标准定义 III 型、IV 型、V 型和Ⅵ
          型的狼疮性肾炎,且肌酐清除率持续低于 30ml/分。其他类型的红斑性狼疮，如盘状狼疮、仅
          累及血液及关节的狼疮不在本协议保障范围內。本病必须由免疫和风湿科专家医师确诊。
          I 型（微小病变型）镜下阴性，尿液正常 II 型（系膜病变型）中度蛋白尿，偶有尿沉渣改变
          III 型（局灶及节段增生型）蛋白尿，尿沉渣改变 IV 型（弥漫增生型）急性肾炎伴有尿沉渣
          改变及／或肾病综合征 V 型（膜型）肾病综合征或重度蛋白尿Ⅵ型（肾小球硬化型）肾小球
          硬化成纤维团状，肾功能差，无法恢复。</p>
        <h4>32、严重克隆病</h4>
        <p>克隆病是一种慢性肉芽肿性肠炎，具有特征性的克隆病病理组织学变化。诊断必须由病理
          检查结果证实。被互助保障人所患的克隆病必须已经造成瘘管形成并伴有肠梗阻 或肠穿孔。</p>
        <h4>33、急性坏死性胰腺炎</h4>
        <p>是指由本社区认可的专科医师确诊为急性坏死性胰腺炎，需进行坏死组织清除、病 灶切除
          或胰腺部分切除的手术治疗，但不包括因酒精中毒引起的急性坏死性胰腺 炎。</p>
        <h4>34、肌营养不良症</h4>
        <p> 指一组原发于肌肉的遗传性疾病，临床表现为与神经系统无关的肌肉无力和肌肉萎缩。且
          须满足下列全部条件：</p>
        <p> （1）肌肉组织活检结果满足肌营养不良症的肌肉细胞变性、坏死等阳性改变；</p>
        <p>（2）自主生活能力完全丧失，无法独立完成六项基本日常生活活动中的三项或三项以上。</p>
        <h4>35、脊髓灰质炎</h4>
        <p>脊髓灰质炎是由于脊髓灰质炎病毒感染所致的瘫痪性疾病，临床表现为运动功能损 害或呼
          吸无力。脊髓灰质炎必须明确诊断。本互助计划仅对脊髓灰质炎造成的神经系统 功能损害
          导致被互助保障人一肢或一肢以上肢体机能永久完全丧失的情况予以理赔。肢体机能永久完
          全丧失，指疾病确诊 180 天后，每肢三大关节中的两大关节仍然完全 僵硬，或不能随意识
          活动。</p>
        <h4>36、终末期肺病慢性肺部疾病导致永久不可逆性的慢性呼吸功能衰竭，必须由呼吸专科医
          师确认并 符合下列所有条件：</h4>
        <p>（1）肺功能测试其 FEV1 持续低于 0.75 升；</p>
        <p>（2）病人缺氧必须广泛而持续地进行输氧治疗；</p>
        <p>（3）动脉血气分析氧分压低于 55mmHg。 理赔时必须提供以上三项相应的证明文件或检
          查报告。</p>
        <h4>37、经输血感染艾 </h4>
        <p>滋病病毒是指被互助保障人感染上人类免疫缺陷病毒并且符合下列所有条件：</p>
        <p>（1）在保障起始日或复效日之后，被互助保障人因治疗必需而接受输血，并且因输血 而感
        <p>染人类免疫缺陷病毒；</p>
        <p>（2）提供输血治疗的输血中心或医院出具该项输血感染属医疗责任事故的报告，或者法院
          终审裁定为医疗责任并且不准上诉；</p>
        <p>（3）提供输血治疗的输血中心或医院必须拥有合法经营执照；</p>
        <p>（4）受感染的被互助保障人不是血友病患者；在任何治愈艾滋病或阻止人类免疫缺陷病毒
          作用的疗法被发现以后，或能防止艾滋病发生的医疗方法被研究出来以后，本保障将不再予
          以赔付。任何因其他传播方式（包括：性传播或静脉注射毒品）导致的人类免疫缺陷病毒感
          染不在本协议保障范围内。互助保障社区必须拥有获得使用被互助保障人的血液样本的权利
          和能够对这些样本进行独立检验的权利。</p>
        <h4>38、肾髓质囊性病</h4>
        <p>肾髓质囊性病的诊断必须同时符合下列要求：</p>
        <p>（1）肾髓质有囊肿、肾小管萎缩及间质纤维化等病理改变；</p>
        <p>（2）贫血、多尿及肾功能衰竭等临床表现；</p>
        <p>（3）诊断须由肾组织活检确定。</p>
        <h4>39、胰岛素依赖型 糖尿病（Ｉ型糖尿 病）</h4>
        <p>胰岛素依赖型糖尿病是由于胰岛素分泌不足引起的慢性血糖升高，并需持续性地依 赖外源
          性胰岛素维持一百八十天以上，须由本社区认可的有资格的内分泌医生确诊 并在本协议互
          助保障责任有效期内，满足下述至少一个条件：</p>
        <p>（1）本社区认可的内分泌医生确定已出现增殖性视网膜病变；</p>
        <p>（2）须植入心脏起搏器治疗心脏病；</p>
        <p>（3）因坏疽需切除一只或以上脚趾。</p>
        <h4>40、植物人指脑皮质广泛性坏死而导致对自身及周边的认知能力完全丧失,但脑干功能依然
          存 在，必须经神经科专科医生明确诊断,并有头颅断层扫描（CT），核磁共振检查（MRI） 或
          正电子发射断层扫描（PET）等影像学检查证实。上述情况必须有至少一个月的 病历记录加
          以证实。由于酗酒或滥用药物所致的植物人状态不在保障范围内。</h4>
        <h4>41、严重川崎病 川崎病为一种病因不明的系统性血管炎。本协议所指严重川崎病是指经心
          脏超声心动图或冠脉造影检查证实川崎病并发冠状动脉瘤，并且实际接受了手术治疗的情
          况。</h4>
        <h4>42、细菌性脑脊髓 膜炎指因细菌引起脑和脊髓的脑脊膜炎性感染，经脑脊液细菌学检查确
          诊，且导致永久性神经损伤。永久性神经损伤是指经社区认可的神经专科医师明确诊断，遗
          留下列 残疾之一而无法复原并持续达一百八十天以上者：</h4>
        <p>（1）符合神经精神病学标准的严重认知功能障碍，而需持续监护；</p>
        <p>（2）听力丧失或失明；</p>
        <p>（3）语言机能丧失；</p>
        <p>（4）肌体功能障碍，导致无法完成其中三项或三项以上的日常生活活动。</p>
        <h4>43、严重幼年类风湿关节炎 幼年类风湿关节炎是一种儿童期结缔组织病。诊断必须由小儿
          风湿科专科医生确 认。本协议仅对实际接受了膝关节或髋关节置换手术治疗的严重的幼年
          类风湿关节炎予以理赔。</h4>
        <h4>44、严重溃疡性结肠炎 本互助计划所保障的溃疡性结肠炎是指伴有致命性电解质紊乱的
          急性暴发性溃疡性结肠炎，病变累及全结肠，表现为严重的血便和系统性症状体征，治疗通
          常采取全结 肠切除和回肠造瘘术。溃疡性结肠炎必须根据组织病理学特点诊断，并且被互
          助保障人已经接受了结肠切除和回肠造瘘术。</h4>
        <h4>45、慢性肾上腺皮 因为自身免疫功能紊乱，使肾上腺组织逐渐受损，而需要长期接受糖皮
          质激素及肾质功能衰竭上腺皮质激素替代疗法。该病必须经国家机关认可的有合法资质的内
          分泌专科医生确诊，并有以下报告作为证据：</h4>
        <p>（1）促肾上腺皮质激素(ACTH)刺激试验；</p>
        <p>（2）胰岛素血糖减少测试；</p>
        <p>（3）血浆促肾上腺皮质激素(ACTH)水平测定；</p>
        <p>（4）血浆肾素活性(PRA)测定。慢性肾上腺皮质功能衰竭只对由自身免疫功能紊乱引起的承
          担互助保障责任，其他原因引起的除外。</p>
        <h4>46、严重哮喘 被互助保障人必须在过去两年内曾发生哮喘持续状态，并符合以下其中两项
          标准，本社区才承担互助保障责任：</h4>
        <p>（1）运动耐受力永久并持续地减少并且轻微的运动能引起气促；</p>
        <p>（2）长期胸腔过渡膨胀而导致胸腔畸形；</p>
        <p>（3）在家及在静息状态下需要吸氧；</p>
        <p>（4）持续的每天服用类固醇药物(至少持续六个月以上)。</p>
        <h4>47、坏死性筋膜炎 坏死性筋膜炎的诊断须同时符合下列要求：</h4>
        <p>（1）符合坏死性筋膜炎的一般临床表现；</p>
        <p>（2）细菌培养检出致病菌；</p>
        <p>（3）出现广泛性肌肉及软组织坏死，并导致身体受影响部位永久完全失去功能。 所谓永久
          完全失去功能是指受影响部位的功能丧失超过六个月者。</p>
        <h4>48、疯牛病 神经系统疾病及致命的成胶质状脑病，并有以下症状：</h4>
        <p>（1）不能控制的肌肉痉挛及震颤；</p>
        <p>（2）逐渐痴呆；</p>
        <p>（3）小脑功能不良，共济失调；</p>
        <p>（4）手足徐动症；诊断必须经神经专科医生基于以下检查报告作出：脑电图、脑脊液报告、
          电脑断层 扫描(CT)及核磁共振(MRI)。</p>
        <h4>49、原发性硬化性胆管炎 指一种胆汁淤积综合征，其特征是肝内、肝外胆道因纤维化性炎
          症逐渐狭窄，并最终导致完全阻塞而发展为肝硬化。本病须经内镜逆行胰胆管造影等影像学
          检查证实，并须满足下列全部条件：</h4>
        <p>（1）总胆红素和直接胆红素同时升高，血清 ALP>200U/L；</p>
        <p> （2）持续性黄疸病史；</p>
        <p> （3）出现胆汁性肝硬化或门脉高压。因肿瘤或胆管损伤等继发性的硬化性胆管炎不在保障
          范围内。</p>
        <h4>50、肝豆状核变性 (Wilson 病) 指由于先天性铜代谢障碍所引起的一种疾病，其特点为肝硬
          化与双侧脑基底神经 节变性同时存在，且须经专科医生明确诊断，并同时必须具备下列情
          况：</h4>
        <p>（1）临床表现包括：进行性加剧的肢体震颤，肌强直，吞咽及发音困难，精神异常。</p>
        <p>（2）角膜色素环（K-F 环）。</p>
        <p>（3）血清铜和血清铜蓝蛋白降低，尿铜增加。</p>
        <p>（4）食管静脉曲张</p>
        <p>（5）腹水。</p>
        <h1>附件三</h1>
        <h2>服务费与互助金标准</h2>
        <p>1. 服务费和互助金均以 INU 通证进行支付。</p>
        <p> 2. 互助金是按照条款和标准的计算出来的服务费的倍数。</p>
        <p> 3. 服务费通常盯住当地法币或稳定型数字货币的价值以 INU 通证进行定价，相对法币和稳
          定型数字货币价格是不变的，但服务费以 INU 的标示的价格会变动，服务费标准以社区
          公布的数字为准。</p>
        <p> 4. 服务费的 INU 与当地法币或稳定型数字货币 USDT 的价格以其在主要交易的交易所 INU
          交易的 5 日移动平均线对应的数值确定，如果 INU 尚未在交易所交易，则 INU 价格以社
          区官方公布的价格依据。</p>
        <p> 5. 最低互助金额为 100RMBx2000xINU 即时市值，互助金给付时 INU 对 RMB 兑换比例，
          以 INU 支付。</p>
        <p> 6. 最高互助金限额为 300 万人民币等值的 INU。</p>
      </div>
      <div class="radio-box">
        <el-form :inline="true" :model="termForm" ref="termForm">
          <el-form-item label="" style="float: right" prop="term"
                        :rules="[{ required: true, message: '请先同意以上条款', trigger: ['blur', 'change']}]">
            <el-radio v-model="termForm.term" class="radio" label="1">我同意以上条款</el-radio>
          </el-form-item>
        </el-form>
      </div>
      <el-form :inline="true" :model="form" ref="form" label-width="100px" class="form-box" size="mini">
        <el-form-item label="INU大病互助" prop="year"
                      :rules="[{ required: true, message: 'INU大病互助', trigger: 'change'}]">
          <el-select v-model="form.year" placeholder="请选择年份" style="width: 80px">
            <el-option v-for="item in years" :key="item" :label="item" :value="item"></el-option>
          </el-select>
        </el-form-item>
        <el-form-item label="年" label-width="20px"></el-form-item>
        <el-form-item label="INU" prop="amount"
                      :rules="[{ required: true, message: 'amount', trigger: 'change'}]">
          <el-input v-model="form.amount" autocomplete="off" style="width: 80px" readonly></el-input>
        </el-form-item>
        <el-form-item label="RMB" prop="money"
                      :rules="[{ required: true, message: 'RMB', trigger: 'change'}]">
          <el-input v-model="form.money" autocomplete="off" style="width: 80px" readonly></el-input>
        </el-form-item>
      </el-form>
      <div slot="footer" class="dialog-footer">
        <el-button class="btn" type="primary" size="small" @click="validate()">确认支付</el-button>
      </div>
    </el-dialog>
  </div>
</template>

<script>
  import api from '../../common/api'
  import vueQr from 'vue-qr'
  export default {
    name: 'buy',
    components: {
      vueQr
    },
    data () {
      return {
        dialogFormVisible: false,
        innerVisible: false,
        imageUrl: '../../../static/img/logo_qr.png',
        codeUrl: '',
        dotScale: 0.6,
        form: {
          year: '',
          amount: '',
          money: '',
        },
        termForm: {
          term: ''
        },
        years: [],
        inuInfo: null,
        params: {
          token: window.sessionStorage.getItem('token'),
          time:''
        },
        timeInterval: null
      }
    },
    created () {
      this.inuInfo = null
      this.years = []
      this.getINU()
    },
    beforeRouteLeave (to, from, next) {
      clearInterval(this.timeInterval)
      next()
    },
    methods: {
      show () {
        this.dialogFormVisible = true
      },
      getINU () {
        api.getInuInfoByType({type: 100}).then(s => {
          this.inuInfo = s.data
          s.data.forEach(p => {
            this.years.push(p.year)
          })
        })
      },
      async validate () {
        let termForm = false
        let form = false
        this.$refs.termForm.validate((v) => {
          termForm = v
        })
        this.$refs.form.validate((valid) => {
          form = valid
        })
        if (form && termForm) {
          this.submit()
        }
      },
      submit () {
        let params = {
          token: window.sessionStorage.getItem('token'),
          amount: this.form.amount,
          type: 100,
          year: this.form.year
        }
        api.postSweepPayment(params).then(s => {
          let codeUrl = s.data
          this.params.time = s.time
          if(codeUrl){
            this.innerVisible = true
            this.$nextTick(() => {
              this.codeUrl = codeUrl
              setTimeout(() =>{
                this.sweepCallBack()
              }, 5000)
            })
          }
        })
      },
      sweepCallBack(){
        let vue = this
        this.timeInterval = setInterval(() => {
          api.sweepCallBack(vue.params).then(s => {
            console.log('sweepCallBack-----', s);
          })
        }, 3000)
      }
    },
    watch: {
      'form.year': function (val) {
        if (val) {
          let find = this.inuInfo.find(s => {
            return s.year === val
          })
          this.form.amount = find.amount
          if (window.sessionStorage.getItem("inuPrice")) {
            this.form.money = window.sessionStorage.getItem("inuPrice") * find.amount
          }
        }
      },
      'innerVisible': function (val) {
        if(val){

        }
      }
    },
  }
</script>

<style scoped>
  .clause {
    height: 40vh;
    overflow-y: scroll;
    line-height: 1.8;
    padding: 0 20px;
    border: 1px solid #eee;
  }

  h1 {
    font-size: 18px;
    margin: 0;
    padding: 0;
  }

  h2 {
    text-align: center;
    font-size: 18px;
    margin: 0;
    padding: 0;
    line-height: 2;
    color: #333;
  }

  h4 {
    font-size: 14px;
    margin: 0;
    padding: 0;
    color: #666;
  }

  p {
    font-size: 12px;
    color: #999;
    margin: 0;
    padding: 0;
  }

  .clause-box >>> .el-dialog__header {
    background: #58acad;
    color: #fff;
  }

  .clause-box >>> .el-dialog__title {
    color: #fff;
  }

  .clause-box >>> .el-dialog__headerbtn .el-dialog__close {
    color: #fff;
  }

  .clause-box >>> .el-button--primary {
    background-color: #58acad;
    border-color: #58acad;
  }

  .form-box {
    margin-top: 20px;
  }

  .clause-box >>> .el-radio__input.is-checked + .el-radio__label {
    color: #58acad
  }

  .clause-box >>> .el-radio__input.is-checked .el-radio__inner {
    background-color: #58acad;
    border-color: #58acad;
  }

  .radio-box {
    overflow: hidden;
  }

  .radio {
    float: right;
    margin-top: 15px;
  }
  .qr-code{
    margin: auto;
  }
  @media (max-width: 767px) {
    .clause-box >>> .el-dialog {
      width: 90%;
    }

    .clause-box >>> .el-dialog__body {
      padding: 20px 20px 0;
    }

    .clause-box >>> .el-dialog__header {
      padding: 10px 20px;
    }

    .clause-box >>> .el-dialog__footer {
      padding: 0 20px 10px;
    }

    .clause-box >>> .el-dialog__headerbtn {
      top: 13px;
    }
  }
</style>
